In [14]:
import numpy as np
import pandas as pd

In [18]:
data = np.array([["uBiome", 100],
                 ["Globant", 200]])

In [22]:
df_columns = ["Company", "Total Workers"]

In [24]:
data

array([['uBiome', '100'],
       ['Globant', '200']], dtype='<U7')

In [26]:
df = pd.DataFrame(data=data, columns=df_columns)

In [28]:
df

   Company Total Workers
0   uBiome           100
1  Globant           200

In [31]:
type(df)

pandas.core.frame.DataFrame

In [33]:
len(df)

2

In [43]:
df["HQs"] = ["San Fransisco", "Buenos Aires"]
df

   Company Total Workers            HQs  TechCompany
0   uBiome           100  San Fransisco         True
1  Globant           200   Buenos Aires         True

In [44]:
df["TechCompany"] = True
df

   Company Total Workers            HQs  TechCompany
0   uBiome           100  San Fransisco         True
1  Globant           200   Buenos Aires         True

In [47]:
data2 = np.array([["My Company", 400]])

In [49]:
df2_columns = ["Company", "TotalWorkers"]

In [50]:
df2 = pd.DataFrame(data=data2, columns=df2_columns)
df2

      Company TotalWorkers
0  My Company          400

In [52]:
df3 = pd.concat([df, df2])

/Users/kuky_nekoi/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [54]:
df3

      Company            HQs TechCompany Total Workers TotalWorkers
0      uBiome  San Fransisco        True           100          NaN
1     Globant   Buenos Aires        True           200          NaN
0  My Company            NaN         NaN           NaN          400

In [55]:
df4 = df3.reset_index()

In [56]:
df4

   index     Company            HQs TechCompany Total Workers TotalWorkers
0      0      uBiome  San Fransisco        True           100          NaN
1      1     Globant   Buenos Aires        True           200          NaN
2      0  My Company            NaN         NaN           NaN          400

In [63]:
df.info()
df2.info()
df3.info()
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
Company          2 non-null object
Total Workers    2 non-null object
HQs              2 non-null object
TechCompany      2 non-null bool
dtypes: bool(1), object(3)
memory usage: 130.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 2 columns):
Company         1 non-null object
TotalWorkers    1 non-null object
dtypes: object(2)
memory usage: 96.0+ bytes
<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 0
Data columns (total 5 columns):
Company          3 non-null object
HQs              2 non-null object
TechCompany      2 non-null object
Total Workers    2 non-null object
TotalWorkers     1 non-null object
dtypes: object(5)
memory usage: 144.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
index            3 non-null int64
Company          3 non-null object
HQs              2 non-null object
TechCompany      2 non-null object
Total Workers    2 non-null object
TotalWorkers     1 non-null object
dtypes: int64(1), object(5)
memory usage: 224.0+ bytes

In [76]:
print(hex(id(df["Company"][0])))
print(hex(id(df2["Company"][0])))
print(hex(id(df3["Company"][0])))
print(hex(id(df4["Company"][0])))
del df
del df2
del df3
print(hex(id(df4["Company"][0])))

0x119f07ce0
0x11a2d1530
0x11a49ada0
0x119f07ce0
0x119f07ce0